MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64GP710A/mcu.h
#define _DMA7CON_MODE1_POSITION                  0x00000001
#define _DMA7CON_MODE1_MASK                      0x00000002
#define _DMA7CON_MODE1_LENGTH                    0x00000001

#define _DMA7CON_AMODE0_POSITION                 0x00000004
#define _DMA7CON_AMODE0_MASK                     0x00000010
#define _DMA7CON_AMODE0_LENGTH                   0x00000001

#define _DMA7CON_AMODE1_POSITION                 0x00000005
#define _DMA7CON_AMODE1_MASK                     0x00000020
#define _DMA7CON_AMODE1_LENGTH                   0x00000001

#define _DMA7REQ_IRQSEL_POSITION                 0x00000000
#define _DMA7REQ_IRQSEL_MASK                     0x0000007F
#define _DMA7REQ_IRQSEL_LENGTH                   0x00000007

#define _DMA7REQ_FORCE_POSITION                  0x0000000F
#define _DMA7REQ_FORCE_MASK                      0x00008000
#define _DMA7REQ_FORCE_LENGTH                    0x00000001

#define _DMA7REQ_IRQSEL0_POSITION                0x00000000
#define _DMA7REQ_IRQSEL0_MASK                    0x00000001
#define _DMA7REQ_IRQSEL0_LENGTH                  0x00000001

#define _DMA7REQ_IRQSEL1_POSITION                0x00000001
#define _DMA7REQ_IRQSEL1_MASK                    0x00000002
#define _DMA7REQ_IRQSEL1_LENGTH                  0x00000001

#define _DMA7REQ_IRQSEL2_POSITION                0x00000002
#define _DMA7REQ_IRQSEL2_MASK                    0x00000004
#define _DMA7REQ_IRQSEL2_LENGTH                  0x00000001

#define _DMA7REQ_IRQSEL3_POSITION                0x00000003
#define _DMA7REQ_IRQSEL3_MASK                    0x00000008
#define _DMA7REQ_IRQSEL3_LENGTH                  0x00000001

#define _DMA7REQ_IRQSEL4_POSITION                0x00000004
#define _DMA7REQ_IRQSEL4_MASK                    0x00000010
#define _DMA7REQ_IRQSEL4_LENGTH                  0x00000001

#define _DMA7REQ_IRQSEL5_POSITION                0x00000005
#define _DMA7REQ_IRQSEL5_MASK                    0x00000020
#define _DMA7REQ_IRQSEL5_LENGTH                  0x00000001

#define _DMA7REQ_IRQSEL6_POSITION                0x00000006
#define _DMA7REQ_IRQSEL6_MASK                    0x00000040
#define _DMA7REQ_IRQSEL6_LENGTH                  0x00000001

#define _DMACS0_XWCOL0_POSITION                  0x00000000
#define _DMACS0_XWCOL0_MASK                      0x00000001
#define _DMACS0_XWCOL0_LENGTH                    0x00000001

#define _DMACS0_XWCOL1_POSITION                  0x00000001
#define _DMACS0_XWCOL1_MASK                      0x00000002
#define _DMACS0_XWCOL1_LENGTH                    0x00000001

#define _DMACS0_XWCOL2_POSITION                  0x00000002
#define _DMACS0_XWCOL2_MASK                      0x00000004
#define _DMACS0_XWCOL2_LENGTH                    0x00000001

#define _DMACS0_XWCOL3_POSITION                  0x00000003
#define _DMACS0_XWCOL3_MASK                      0x00000008
#define _DMACS0_XWCOL3_LENGTH                    0x00000001

#define _DMACS0_XWCOL4_POSITION                  0x00000004
#define _DMACS0_XWCOL4_MASK                      0x00000010
#define _DMACS0_XWCOL4_LENGTH                    0x00000001

#define _DMACS0_XWCOL5_POSITION                  0x00000005
#define _DMACS0_XWCOL5_MASK                      0x00000020
#define _DMACS0_XWCOL5_LENGTH                    0x00000001

#define _DMACS0_XWCOL6_POSITION                  0x00000006
#define _DMACS0_XWCOL6_MASK                      0x00000040
#define _DMACS0_XWCOL6_LENGTH                    0x00000001

#define _DMACS0_XWCOL7_POSITION                  0x00000007
#define _DMACS0_XWCOL7_MASK                      0x00000080
#define _DMACS0_XWCOL7_LENGTH                    0x00000001

#define _DMACS0_PWCOL0_POSITION                  0x00000008
#define _DMACS0_PWCOL0_MASK                      0x00000100
#define _DMACS0_PWCOL0_LENGTH                    0x00000001

#define _DMACS0_PWCOL1_POSITION                  0x00000009
#define _DMACS0_PWCOL1_MASK                      0x00000200
#define _DMACS0_PWCOL1_LENGTH                    0x00000001

#define _DMACS0_PWCOL2_POSITION                  0x0000000A
#define _DMACS0_PWCOL2_MASK                      0x00000400
#define _DMACS0_PWCOL2_LENGTH                    0x00000001

#define _DMACS0_PWCOL3_POSITION                  0x0000000B
#define _DMACS0_PWCOL3_MASK                      0x00000800
#define _DMACS0_PWCOL3_LENGTH                    0x00000001

#define _DMACS0_PWCOL4_POSITION                  0x0000000C
#define _DMACS0_PWCOL4_MASK                      0x00001000
#define _DMACS0_PWCOL4_LENGTH                    0x00000001

#define _DMACS0_PWCOL5_POSITION                  0x0000000D
#define _DMACS0_PWCOL5_MASK                      0x00002000
#define _DMACS0_PWCOL5_LENGTH                    0x00000001

#define _DMACS0_PWCOL6_POSITION                  0x0000000E
#define _DMACS0_PWCOL6_MASK                      0x00004000
#define _DMACS0_PWCOL6_LENGTH                    0x00000001

#define _DMACS0_PWCOL7_POSITION                  0x0000000F
#define _DMACS0_PWCOL7_MASK                      0x00008000
#define _DMACS0_PWCOL7_LENGTH                    0x00000001

#define _DMACS0_XWCOL_POSITION                   0x00000000
#define _DMACS0_XWCOL_MASK                       0x000000FF
#define _DMACS0_XWCOL_LENGTH                     0x00000008

#define _DMACS0_PWCOL_POSITION                   0x00000008
#define _DMACS0_PWCOL_MASK                       0x0000FF00
#define _DMACS0_PWCOL_LENGTH                     0x00000008

#define _DMACS1_PPST0_POSITION                   0x00000000
#define _DMACS1_PPST0_MASK                       0x00000001
#define _DMACS1_PPST0_LENGTH                     0x00000001

#define _DMACS1_PPST1_POSITION                   0x00000001
#define _DMACS1_PPST1_MASK                       0x00000002
#define _DMACS1_PPST1_LENGTH                     0x00000001

#define _DMACS1_PPST2_POSITION                   0x00000002
#define _DMACS1_PPST2_MASK                       0x00000004
#define _DMACS1_PPST2_LENGTH                     0x00000001

#define _DMACS1_PPST3_POSITION                   0x00000003
#define _DMACS1_PPST3_MASK                       0x00000008
#define _DMACS1_PPST3_LENGTH                     0x00000001

#define _DMACS1_PPST4_POSITION                   0x00000004
#define _DMACS1_PPST4_MASK                       0x00000010
#define _DMACS1_PPST4_LENGTH                     0x00000001

